#define _CRT_SECURE_NO_WARNINGS 
#include"student.h"




// 显示菜单(学生端) 
void displayMenuOfStudent() {
	system("cls");
	printf("=========== 学生管理系统 =================\n");
	printf("********** 已登录学生端 ******************\n");
	printf("********** 1. 个人信息查看 ***************\n");
	printf("********** 2. 查询个人成绩 ***************\n");
	printf("********** 3. 查询本班成绩 ***************\n");
	printf("********** 4. 成绩分析 *******************\n");
	printf("********** 5. 返回上一层 *****************\n");
	printf("********** 0. 退出系统 *******************\n");
	printf("==========================================\n");
}






// 显示菜单(教师端) 
void displayMenuOfTeacher() {
	system("cls");
	printf("=========== 学生管理系统 ==============================\n");
	printf("********** 已登录教师端 *******************************\n");
	printf("********** 1. 查看所有学生信息 ************************\n");
	printf("********** 2. 添加学生信息(默认添加到末尾) ************\n");
	printf("********** 3. 查找学生信息 ****************************\n");
	printf("********** 4. 插入学生信息(可插入任意位置) ************\n");
	printf("********** 5. 修改学生信息 ****************************\n");
	printf("********** 6. 删除学生信息 ****************************\n");
	printf("********** 7. 保存数据到文件 **************************\n");
	printf("********** 8. 查看学生成绩列表 ************************\n");
	printf("********** 9. 成绩分析 ********************************\n");
	printf("********** A. 返回上一层 ******************************\n");
	printf("********** 0. 退出系统 ********************************\n");
	printf("=======================================================\n");
}



// 显示菜单(管理员端) 
void displayMenuOfAdministrator() {
	system("cls");
	printf("=========== 学生管理系统 ==============\n");
	printf("********** 已登录管理员端 ***********\n");
	printf("********** 1. 添加账号 ************\n");
	printf("********** 2. 查看账号 ***********\n");
	printf("********** 3. 修改密码 ***********\n");
	printf("********** 4. 删除账号 ***********\n");
	printf("********** 5. 查看所有学生信息 ***********\n");
	printf("********** 6. 添加学生信息(默认添加到末尾) ************\n");
	printf("********** 7. 查找学生信息 ************\n");
	printf("********** 8. 插入学生信息(可插入任意位置) ************\n");
	printf("********** 9. 修改学生信息 ***************************\n");
	printf("********** A. 删除学生信息 ************\n");
	printf("********** B. 保存数据到文件 **********\n");
	printf("********** C. 从文件加载数据 **********\n");
	printf("********** D. 返回上一层 *************\n");
	printf("********** 0. 退出系统 **************\n");
	printf("=======================================\n");
}