#define _CRT_SECURE_NO_WARNINGS 
#include"student.h"
 
// 显示登录菜单
void displayMenuOfLogin() {
	system("cls");
	printf("=========== 学生管理系统 ==============\n"); 
	printf("========== 请选择登录身份:=============\n");
	printf("********** 1. 管理员登录 **************\n"); 
	printf("********** 2. 教师登录 ****************\n");
	printf("********** 3. 学生登录 ****************\n");
	printf("********** 0. 退出系统 ****************\n");
	printf("=======================================\n");
}    





// 显示菜单(管理员端) 
void displayMenuOfAdministrator() {
	system("cls");
	printf("=========== 学生管理系统 ==============\n"); 
	printf("********** 已登录管理员端 ***********\n"); 
	printf("********** 1. 查看代办 ********\n");  
	printf("********** 8. 添加账号 ************\n");  
	printf("********** 3. 查看账号 ***********\n"); 
	printf("********** 4. 修改密码 ***********\n");  
	printf("********** 5. 删除账号 ***********\n");  
	printf("********** 3. 查看所有学生信息 ***********\n");
	printf("********** 2. 添加学生信息(默认添加到末尾) ************\n"); 
	printf("********** 3. 查找学生信息 ************\n"); 
	printf("********** 4. 插入学生信息(可插入任意位置) ************\n"); 
	printf("********** 5. 修改学生信息 ************\n");
	printf("********** 6. 删除学生信息 ************\n");
	printf("********** 7. 保存数据到文件 **********\n");  
	printf("********** 8. 从文件加载数据 **********\n"); 
	printf("********** 9. 返回上一层 *************\n"); 
	printf("********** 0. 退出系统 **************\n");
	printf("=======================================\n");
}



// 显示菜单(教师端) 
void displayMenuOfTeacther() { 
	system("cls");
	printf("=========== 学生管理系统 ==============\n"); 
	printf("********** 已登录教师端 ***********\n");
	printf("********** 3. 查看所有学生信息 ***********\n");
	printf("********** 2. 添加学生信息(默认添加到末尾) ************\n");
	printf("********** 3. 查找学生信息 ************\n");
	printf("********** 4. 插入学生信息(可插入任意位置) ************\n");
	printf("********** 5. 修改学生信息 ************\n");
	printf("********** 6. 删除学生信息 ************\n");
	printf("********** 7. 保存数据到文件 **********\n");
	printf("********** 8. 成绩分析 *****************\n");
	printf("********** 9. 返回上一层 *************\n");
	printf("********** 0. 退出系统 **************\n");
	printf("=======================================\n");
}


// 显示菜单(学生端) 
void displayOfStudent() { 
	system("cls");
	printf("=========== 学生管理系统 ==============\n"); 
	printf("********** 已登录学生端 ***********\n");
	printf("********** 1. 个人信息查看 ***************\n"); 
	printf("********** 1. 查询个人成绩 ***************\n");
	printf("********** 2. 查询本班成绩 ***************\n"); 
	printf("********** 8. 成绩分析 *******************\n"); 
	printf("********** 9. 返回上一层 *************\n");
	printf("********** 0. 退出系统 **************\n");
	printf("=======================================\n");
}