#define _CRT_SECURE_NO_WARNINGS 
#include"student.h"
 

// 显示初始界面
void displayInitialInterfal() {
	system("cls");
	printf("=======================================\n");
	printf("=========== 学生管理系统 ==============\n");
	printf("=======================================\n");
	printf("\n\n");
	printf("          欢迎使用学生管理系统         \n");
	printf("\n\n");
	printf("=======================================\n");
	printf("=======================================\n");
	system("pause");
	system("cls");
}  


// 显示操作界面
void displayOfOperation() {
	printf("请选择要执行的操作:\n");
	printf("===================\n");
	printf("*** 1. 登录账号 ***\n");
	printf("*** 2. 注册账号 ***\n");
	printf("*** 3. 找回密码 ***\n");
	printf("*** 0. 退出系统 ***\n");
	printf("===================\n");
} 







// 显示登录菜单
void displayMenuOfLogin() {
	system("cls");
	printf("=========== 学生管理系统 ==============\n"); 
	printf("========== 请选择登录身份:=============\n");
	printf("********** 1. 学生登录 ****************\n"); 
	printf("********** 2. 教师登录 ****************\n");
	printf("********** 3. 管理员登录 **************\n");
	printf("********** 0. 返回上一级 **************\n");
	printf("=======================================\n");
}    





