#define _CRT_SECURE_NO_WARNINGS 
#include"student.h"

// 显示菜单(管理员端)
void displayMenu() {
    system("cls");  
    printf("=========== 学生管理系统 ==============\n");
    printf("********** 1. 显示所有学生信息 ********\n");
    printf("********** 2. 添加学生信息(默认添加到末尾) ************\n");
    printf("********** 3. 查找学生信息 ************\n");
    printf("********** 4. 根据成绩进行排序 ********\n");
    printf("********** 5. 修改学生信息 ************\n");
    printf("********** 6. 删除学生信息 ************\n");
    printf("********** 7. 保存数据到文件 **********\n");
    printf("********** 0. 退出系统 **************\n");
    printf("=======================================\n");
    printf("请选择你要进行的操作\n");
}